Dlubal.DynamPro.IModuleCaseBase
Interface for working with module case.

Dlubal.DynamPro.IModuleCaseBase.GetNo
Gets the number of the module case.
Returns: Number of the module case.

Dlubal.DynamPro.IModuleCaseBase.GetDescription
Gets the description of the module case.
Returns: Description of the module case.

Dlubal.DynamPro.IModuleCaseBase.SetDescription(System.String)
Sets the description of the module case.
Description: Description of the module case.

Dlubal.DynamPro.IModuleCaseBase.GetComment
Gets the comment of the module case.
Returns: Comment of the module case.

Dlubal.DynamPro.IModuleCaseBase.SetComment(System.String)
Sets the comment of the module case.
Comment: Comment of the module case.

Dlubal.DynamPro.IModuleCaseBase.Clone(System.Int32)
Clones the module case and returns the new one interface.
Returns: Cloned module case interface.
NewNo: Number of the cloned module case. Zero means number should be assigned by RFEM."

Dlubal.DynamPro.IModuleCaseBase.Delete
Deletes the load case.

Dlubal.DynamPro.IModuleCaseBase.HasResults
Check whether the load case has any results.
Returns: True if the module case has any results, otherwise false.